{
  "titles": [
    [
      "Royal Caribbean Cruises"
    ],
    [
      "Royal Caribbean International"
    ],
    [
      "Celebrity Cruises"
    ],
    [
      "Azamara Quest"
    ],
    [
      "Azamara Journey"
    ],
    [
      "Azamara Pursuit"
    ],
    [
      "Silversea Cruises"
    ]
  ],
  "contents": [
    [
      "Royal Caribbean Cruises\nRoyal Caribbean Cruises Ltd. (RCCL) is a global cruise holding company incorporated in Liberia and based in Miami, Florida. It is the world's second-largest cruise line operator, after Carnival Corporation & plc. As of March 2009, Royal Caribbean Cruises Ltd. fully owns three cruise lines: Royal Caribbean International, Celebrity Cruises, and Azamara Club Cruises. They also hold a 67% stake in Silversea Cruises,[2] a 50% stake in TUI Cruises and 49% stakes in Pullmantur Cruises and the now-defunct CDF Croisières de France.[3][4] Previously Royal Caribbean Cruises also owned 50% of Island Cruises, but this was sold to TUI Travel PLC in October 2008.[5]",
      "History\nRoyal Caribbean Cruises Ltd. was formed in 1997 when Royal Caribbean Cruise Line purchased Celebrity Cruises. The decision was made to keep the two cruise line brands separate following the merger; as a result Royal Caribbean Cruise Line was re-branded Royal Caribbean International and Royal Caribbean Cruises Ltd. was established as the new parent company of both Royal Caribbean International and Celebrity Cruises.[6]\nA third brand under Royal Caribbean Cruises ownership was formed in 2000 when Island Cruises was created as a joint venture with British First Choice Holidays. Island Cruises became an informal cruise line on the British and Brazilian markets.[7]\nFrom there, the company expanded rapidly with the creation of Azamara Club Cruises in May 2007 as a subsidiary of Celebrity Cruises.[8] It followed this with the formation of CDF Croisières de France in May 2008 to serve the French-language market.[9]\nRoyal Caribbean also has an interest in TUI Cruises, a joint venture with TUI AG,[10] which began operations in 2009 aimed at a German-speaking audience. TUI Cruises's subsidiary, TUI Travel, had a 50% interest in Island Cruises following their merger with First Choice Holidays in 2007.[11] In October 2008, Royal Caribbean Cruises rationalized their holdings by selling their share of Island Cruises to TUI.[5]\nIn early 2019, Royal Caribbean announced in a joint venture with ITM Group the formation of Holistica, a company that intends to develop cruise destinations.[12] The only known destination that the company is to develop is the Grand Lucayan Resort, located in Freeport after the hotel campus was sold to newly formed subsidiary by the Bahamian Government."
    ],
    [
      "Royal Caribbean International\nRoyal Caribbean International (RCI), previously known as Royal Caribbean Cruise Line (RCCL), is a cruise line brand founded in 1968 in Norway and organised as a wholly owned subsidiary of Royal Caribbean Cruises Ltd. (RCCL) since 1997. Based in Miami, Florida, United States, it is the largest cruise line by revenue and second largest by passengers counts. In 2018, Royal Caribbean International controlled 19.2% of the worldwide cruise market by passengers and 14.0% by revenue.[3] It also operates many of the world's largest ships; as of July 2019, the line operates twenty-six ships, including the four largest cruise ships in the world, and has six additional ships on order.",
      "Company and brand history\nRoyal Caribbean Cruise Line was founded in 1968 by three Norwegian shipping companies: Anders Wilhelmsen & Company, I.M. Skaugen & Company, and Gotaas Larsen. The newly created line put its first ship, the Song of Norway, into service two years later. A year later, the line added the Nordic Prince to the fleet and in 1972 it added the Sun Viking. In 1978, Song of Norway became Royal Caribbean's first passenger ship to be lengthened. This was accomplished via the insertion of an 85-foot (26 m) section to the vessel's severed center. Following the success of this work, Nordic Prince was also stretched in 1980. During the stretching on both ships, their sterns were modified. However the Sun Viking was not stretched or modified and remained the same size and shape. Royal Caribbean received widespread global recognition when in 1982 it launched the Song of America, over twice the size of Sun Viking and at the time the third largest passenger vessel afloat (after the Norway and Queen Elizabeth 2).",
      "In 1986, Royal Caribbean leased a coastal property in Labadie, Haiti to be used as a private destination for its guests, renamed as Labadee.[4] After a corporate restructuring in 1988, the line launched Sovereign of the Seas, the largest passenger vessel afloat at the time.[5] That same year, Royal Caribbean also merged with Admiral Cruises.[6] Two years later in 1990, Nordic Empress and Viking Serenade also entered service, while Royal Caribbean purchased a second private destination, Little Stirrup Cay, an island in the Bahamas, which they branded as CocoCay.[6]",
      "The second and third Sovereign-class cruise ships Monarch of the Seas and Majesty of the Seas were delivered in 1991 and 1992 respectively.\nRoyal Caribbean went public on the New York Stock Exchange in 1993. Over the next two years, the company experienced rapid growth, and it built a new corporate headquarters in Miami, Florida, and replaced the Nordic Prince with a new vessel, the Legend of the Seas.[7]\nFollowing these events, two new Vision-class vessels entered service, the Splendour of the Seas and Grandeur of the Seas. In 1996, the company contracted with Finland's Aker Finnyards for the construction of 130,000-ton vessels and, in 1997, the line's oldest ship, Song of Norway, was sold and two new Vision-class ships entered service, Rhapsody of the Seas and Enchantment of the Seas."
    ],
    [
      "Celebrity Cruises\nCelebrity Cruises is a cruise line which was founded in 1988 by the Greece-based Chandris Group. In 1997, Celebrity Cruises Ltd. merged with Royal Caribbean Cruise Line to form Royal Caribbean Cruises Ltd., and has been a wholly owned subsidiary of the latter since then. The company has its headquarters in Miami, Florida.[1] Celebrity's signature logo is an \"Χ\" displayed on the funnel of Celebrity ships, and is the Greek letter chi, for \"Chandris\".[2][3]",
      "History\nCelebrity Cruises was founded in April 1988 as a subsidiary of the Greece-based Chandris Group to operate upmarket cruise ships to Bermuda.[4][5] Chandris had been involved in cruise traffic since the 1960s,[3] and during the late 1980s the company operated in the United States market under the brand name Chandris Cruises. Chandris Fantasy Cruises targeted the lower end of the cruise passenger market, with fleets consisting of second-hand ocean liners.[6] Celebrity Cruises came into existence when, in April 1988, Home Lines, at the time one of the world's leading premium cruise lines, was sold to Holland America Line. Home Lines' ships had held two of the five contracts offered by the Government of Bermuda to cruise lines, giving the ships priority berthing arrangement and unlimited access of sail to the islands in exchange for the ships sailing to Bermuda between April and October each year. Although these contracts were highly valued, Holland America Line decided to withdraw the former Home Lines ships from this service, leaving an opening for two new ships to gain access. Chandris wanted to acquire the contracts, but the Government of Bermuda was only willing to award them to upmarket cruise lines, which Chandris Fantasy Cruises was not.[4]",
      "Recent developments\nIn 2014, Celebrity Cruises launched a blog called \"Catalyst,\" which covered travel, fashion and culture.[22]\nIn April 2015, Celebrity's oldest ship at the time, the Celebrity Century, departed the fleet.[23]\nOn 4 December 2014, Celebrity Cruises signed of a letter of intent for a new class of vessels. The two 2,900-guest, 117,000 GT ships, will be developed under the project name EDGE and will build upon the brand's Millennium-class and Solstice-class vessels. The company took delivery of the first Edge-class vessel, the Celebrity Edge, on 31 October 2018,[24] and expects to receive the second Edge-class vessel, the Celebrity Apex, delivered in the early part of 2020.[25]",
      "Celebrity Cruises announced on 11 October 2017, that it will perform legal same-sex marriages on its ships while in international waters following the legalization of same-sex marriage in Malta, where most of the Celebrity fleet is registered.[30] The company already hosted same-sex marriages while docked in jurisdictions where they are legal, but the change in Maltese law allowed the company's captains to perform legally recognized marriages while in international waters.[31]\nIn July 2018, the company announced its intention to invest more than $500 million to refurbish all Millennium-class and Solstice-class ships in the company's fleet between 2019 and 2023.[32]"
    ],
    [
      "Azamara Quest\nAzamara Quest is an R-class cruise ship that entered service for Azamara Cruises on 24 October 2007. She was built in 2000 for Renaissance Cruises as R Seven. Following the collapse of Renaissance Cruises in 2001 she was laid up for two years, until chartered to the Germany-based Delphin Seereisen as Delphin Renaissance. In 2006 she was sold to the Spain-based Pullmantur Cruises and renamed Blue Moon. She sailed for Pullmantur until 2007 when she was transferred to Azamara Cruises.[1] The Azamara Quest carries about 710 passengers (double occupancy) plus 410 crew members (1:2 staff to guest ratio). Her first season was in the Caribbean. Due to her small size, she is able to call at some of the lesser-visited ports such as St. Barts and Guadeloupe. Sisterships: Azamara Journey, Azamara Pursuit, MS Insignia, MS Sirena, MS Regatta, MS Nautica, Pacific Princess.",
      "2012 fire\nIn March 2012 the ship suffered a fire in one of the engine rooms[6] which temporarily disabled the ship, carrying 1,001 passengers and crew in waters south of the Philippines. Five crew were injured in the fire, which broke out on 30 March 2012 at 8:19pm EDT, a day after the ship left Manila for Sandakan, Malaysia. It was limited to the engine room and \"quickly contained\", according to Azamara. None of the passengers were injured. Many guests praised the efforts of the crew and the entertainment department for keeping spirits high immediately following the harrowing experience.[7]",
      "In popular culture\nIn 2015, the Azamara Journey and the Azamara Quest were the ships used by television presenter and biologist Nigel Marven for his UKTV documentary and travel program Cruise Ship Adventures with Nigel Marven. The program highlighted wildlife areas at popular cruise destinations.[8]"
    ],
    [
      "Azamara Journey\nAzamara Journey is an R-class cruise ship owned and operated by Azamara Club Cruises, a subsidiary of Royal Caribbean Cruises. Gross register tonnage is 30,277, with a capacity of 694 passengers (double occupancy), plus 390 crew members. She was built in 2000 for Renaissance Cruises as R Six. After the bankruptcy of Renaissance Cruises, she sailed for Pullmantur Cruises who renamed her Blue Star in 2003 and Blue Dream in 2005.",
      "History\nThe ship was built in 2000 by the Chantiers de l'Atlantique in Saint-Nazaire, the sixth ship of the comprehensive eight ships \"R-Class\" for Renaissance Cruises shipping company and was named R Six. The ship was sold in early 2001 to the Cruise Company Invest. Due to illiquidity turned Renaissance Cruises end of September 2001 the operation and the R Six was launched mid-2003. She was then chartered to the cruise line Pullmantur Cruises and use of this under the marketing name for Blue Star Cruises (but not yet officially renamed). ",
      "Since July 2005, the ship was called the Blue Dream. From 2006, the ship was used by Pullmantur. Royal Caribbean Cruises Ltd., the parent company of Pullmantur, transferred the Blue Dream on 15 December 2008 its new subsidiary Azamara Cruises, where it was renamed Azamara Journey; and since then with her sister ship Azamara Quest, the former R Seven, and since 2018 with her sister ship Azamara Pursuit, the former R Eight, is used worldwide for cruises.[2][3] Azamara Cruises has been renamed Azamara Club Cruises. In 2015, the Azamara Journey and the Azamara Quest were the ships used by television presenter and biologist Nigel Marven for his UKTV documentary/travel program \"Cruise Ship Adventures with Nigel Marven\", during which Nigel showed areas with outstanding wildlife that can be visited in popular cruise destinations.[4]"
    ],
    [
      "Azamara Pursuit\nAzamara Pursuit (previously R Eight, Minerva II, Royal Princess and Adonia) is a cruise ship operating for Azamara Club Cruises. The ship was built by Chantiers de l'Atlantique at their shipyard in St. Nazaire, France in 2001. Azamara Pursuit is a sister ship of Azamara Journey and Azamara Quest, as well as Pacific Princess of Princess Cruises, and Regatta, Nautica, Insignia and Sirena of Oceania Cruises. She previously sailed for Renaissance Cruises, Swan Hellenic, Princess Cruises, P&O Cruises and Fathom. Azamara acquired the ship in 2017,[3] renamed the vessel the Azamara Pursuit in March 2018[3] and began operating the ship in August 2018 after an extensive refit.[4]",
      "Service history\nR Eight\nOriginally built as the last of eight 'R' class ships for Renaissance Cruises, Azamara Pursuit was first known as R Eight, and entered service in 2001.[5] After Renaissance ceased operations and filed for bankruptcy in late 2001, the vessel was seized by creditors and laid up in Marseille, France.\nMinerva II\nIn 2003, the vessel re-entered operation, this time as the sole cruise ship in Swan Hellenic's fleet. The vessel was named Minerva II, after both the Roman goddess and the company's previous vessel, Minerva.",
      "Farewell Voyage\nOn 26 September 2017 P&O announced[16] that Adonia would be retired in March 2018 with the last cruise leaving Barbados on 23 February and ending in Barbados on 9 March 2018. She arrived at the Grand Bahama Shipyard on 13 March 2018 and was officially handed over to Azamara the following day.[17] She completed a short drydocking in Grand Bahama (which included hull inspections, along with changing her name and registry) before sailing for Belfast's Harland and Wolff shipyard."
    ]
    ,
    [
      "Silversea Cruises\nSilversea Cruises is a luxury cruise line with its headquarters in Monaco owned by Royal Caribbean Cruises Ltd. Founded in 1994 by the Vlasov Group of Monaco and the Lefebvre family of Rome it pioneered all-inclusive cruising with its first ship, Silver Cloud.[1] In June 2018 Royal Caribbean Cruises Ltd acquired a 67% controlling stake in the cruise line.[2]",
      "History\nSilversea was founded in 1994 by a joint venture between V-Ships (previously known as Vlasov Group) of Monaco and the Lefebvre family of Rome. The joint owners had previously been the co-owners of Sitmar Cruises.[3][4] As a marketing strategy the new line introduced all inclusive fares including gratuities, beverages, port charges, travel insurance, and some complimentary shore excursions.[4] As about 80 percent of Silversea's customers were expected to come from North America, the line established a sales office in Miami, Florida. Silversea's first ship, Silver Cloud, which entered service in April 1994, was followed in January 1995 by a sister ship, the Silver Wind.[5] ",
      "In September 2000, the line launched Silver Shadow and Silver Whisper in January 2001. Both of these ships were enlarged versions of the original two ships, but carrying about 100 more passengers. In December 2009, Silversea launched the Silver Spirit. On 18 June 2012, Silversea acquired Canodros S.A., an Ecuadorian tourism company that operated in the Galapagos Islands. The purchase of the line also included the former Renaissance ship Galapagos Explorer II. She was subsequently moved into the Silversea Expeditions brand along with Silver Explorer.[6] "
    ]
  ],
  "questions": [
    [
      "How big is RCCL?",
      "What happened in October 2008?"
    ],
    [
      "How many ships the RCCL operates?",
      "What is the RCCL's first passenger ship?",
      "When Nordic Empress entered service?",
      "Where the headquarter was built??"
    ],
    [
      "What is the signature logo of Celebrity?",
      "Why Holland America Line withdraw the former Home Lines ships?",
      "Who launched the blog called “Catalyst”?",
      "How many dollars the company announced to invest in July 2018?"
    ],
    [
      "Type your question",
      "Type your question",
      "Type your question"
    ],
    [
      "Type your question",
      "Type your question",
      "Type your question"
    ],
    [
      "Type your question",
      "Type your question",
      "Type your question"
    ],
    [
      "Type your question",
      "Type your question",
      "Type your question"
    ]
  ]
}